{"consoles":[
  {
    "name": "Playstation",
    "developer": "Sony",
    "releaseDate": "3rd December 1994",
    "unitsSold": "Roughly 102,000,000",
    "memory": "2MB RAM, 1MB VRAM",
    "storage": "Memory card",
    "photo": "ps1.jpg",
    "ref": "ps1",
    "sonasR": "Cool and way ahead of its time - 9.5/10",
    "moreInfoRef": "https://uk.ign.com/articles/1998/08/28/history-of-the-playstation",
    "moreInfo": "On December 3, 1994, the PlayStation was finally released in Japan, one week after the Sega Saturn. The initial retail cost was 37,000 yen, or about $387. Software available at launch included King's Field, Crime Crackers, and Namco's Ridge Racer, the PlayStation's first certifiable killer app. It was met with long lines across Japan, and was hailed by Sony as their most important product since the WalkMan in the late 1970's. Also available at launch were a host of peripherals, including: a memory card to save high scores and games; a link cable, whereby you could connect two PlayStations and two TVs and play against a friend; a mouse with pad for PC ports; an RFU Adaptor; an S-Video Adaptor; and a Multitap Unit. Third party peripherals were also available, including Namco's Negcon. The look of the PlayStation was dramatically different than the Saturn, which was beige (in Japan), bulky, and somewhat clumsy looking. In contrast, the PlayStation was slim, sleek, and gray, with a revolutionary controller that was years ahead of the Saturn's SNES-like pad. The new PSX joypad provided unheardof control by adding two more buttons on the shoulder, making a total of eight buttons. The two extended grips also added a new element of control. Ken Kutaragi realized the importance of control when dealing with 3 Dimensional game worlds. We probably spent as much time on the joypad's development as the body of the machine. Sony's boss showed special interest in achieving the final version so it has his seal of approval. To Sony's delight, the PlayStation sold more than 300,000 units in the first 30 days. The Saturn claimed to have sold 400,000, but research has shown that number to be misleading. The PSX sold through (to customers) 97% of its stock, while many Saturns were still sitting on the shelves. These misleading numbers were to be quoted by Sega on many occasions, and continued even after the US launch."
  },
  {
    "name": "Playstation 2",
    "developer": "Sony",
    "releaseDate": "4th March 2000",
    "unitsSold": "Around about 158,000,000",
    "memory": "32MB RDRAM, 4MB eDRAM",
    "storage": "40 GB hard drive (add-on)",
    "photo": "ps2.jpg",
    "ref": "ps2",
    "sonasR": "Ran GTA SanAndreas - 10/10",
    "moreInfoRef": "https://www.cnet.com/reviews/sony-ps2-review/",
    "moreInfo": "With a year's head start on Microsoft's Xbox and Nintendo's GameCube, the PS2 platform has one big advantage over the competition: a greater selection of quality games, though the gap is quickly narrowing, particularly with the Xbox. On top of that, it doubles as a DVD player right out of the box and offers online gaming to both broadband and dial-up users via its Online Adaptoraccessory. So while it may not be the newest or the most powerful system, it's certainly a safe bet. The PlayStation 2 can stand on its side or lie flat to fit any space. And once it is installed into your home theater, you'll be treated to a reasonably sharp picture and high-quality sound. The PlayStation 2, like every other console, has a composite A/V cord in the box, which you use to connect the console to your TV. However, S-Video and component-video connectors are also available separately if you'd like to improve the picture quality. For surround-sound audio, there's a built-in optical digital audio jack. With recent graphics library updates, the PS2 will soon support HDTV resolutions and 16:9 wide-screen setting as the Xbox does. One of the first games to take advantage of this higher resolution: Namco's Tekken 4, which looks utterly amazing. Its graphics are even a worthy rival to those of the Xbox's Dead or Alive 3. When compared directly to the Xbox, the PS2's 128-bit Emotion Engine yields in-game graphics with more jagged edges. People playing on an ordinary TV aren't too likely to notice those flaws. But if you compare the two systems on a high-resolution, HD-ready set, the edges in Xbox games look significantly smoother. In some ways, even the little Nintendo GameCube graphically surpasses the PS2. Luigi's Mansion and Rogue Leader look exceedingly crisp on the 'Cube, and the animation in Batman Vengeance is smoother than it is in the PS2 version."
  },
  {
    "name": "Playstation 3",
    "developer": "Sony",
    "releaseDate": "11th November 2006",
    "unitsSold": "Just over 80,000,000",
    "memory": "256MB XDR DRAM, 256MB GDDR3",
    "storage": "Ranging from 12GB to 500GB",
    "photo": "ps3.jpg",
    "ref": "ps3",
    "sonasR": "PSN fell behind Xbox live, good graphics and vast game library - 9/10",
    "moreInfoRef": "https://www.digitaltrends.com/video-game-system-reviews/sony-playstation-3-review/",
    "moreInfo": "Lagging a full year behind the release of Microsofts Xbox 360 and lacking the immediately attention-grabbing hook of Nintendo's 360-degree motion-sensing Wii, Sony's long-awaited PlayStation 3 has recently been the subject of much heated debate. Despite its obvious appeal to diehard gamers and fans of the world's most popular console brand - not to mention home theater enthusiasts, what with 1080p HDMI output and extensive online music/video download capabilities - questions have been plentiful. For example: Is the system, available in 20GB ($499, sans WiFi and a built-in combination Memory Stick product lineup, Compact Flash and SD/MMC card reader) or $599 chrome-trimmed wireless-ready 60GB hard drive models, worth the hefty asking price, the highest since early-90s systems like CDi and 3DO? Can Sony, who's recently cut back North American November 17th launch date ship projections to just 400,000 units (with some analysts predicting actual distribution of half this number or fewer machines), manage to avoid aggravating a soon-to-be-device-deprived buying public while still keeping up with the competition? And, of course, with so much power and hardware combined in a single unit catered to the highest-end luxury users, is there even a point to upgrading? The short answer to all: Yes, depending which of school of thought you fall into, your game playing habits and how much disposable income you've got to burn. However, let's get one thing out of the way up-front, before you freeze your poor behind off spending all night camped out in front of the local electronics retailer hoping to score one of the severely under-stocked devices. For a host of reasons ranging from technical niggles to launch lineup shortfalls to pure common sense, it's perfectly fine - and in most cases, even advisable - to skip buying one this holiday season and wait until the dust settles sometime early in 2007. Right from the get-go, it's important to consider the following fact: You're not actually buying a videogame console here (although surely, that's the machine's strength and the chief function most prospective buyers intend to employ it towards) so much as a full-fledged digital media hub. As slick as everything from cutting-edge digital diversions and Blu-ray movies - video resolutions ranging all the way from 480i up to an eye-popping 1080p are supported - it's what you personally make of the machine that gives the gizmo its true value. So for all of you who've been pestered since, oh, 2004 by your wide-eyed little pride and joys, remember: Dropping $599 just so kids can use the beast as an overgrown Atari may be a little much. They'll be just as entertained by lower-resolution outings for other systems like Nintendo's Wii or Sony's own PlayStation 2. And, in truth, most PlayStation 3 titles right now are simply enhanced ports of existing products anyway (see offerings like Tony Hawk's Project 8 or NHL 2K7). What's more, unless you plan on clocking in time behind the controller yourself, investing in a library of next-generation movies, browsing the Web on your TV, purchasing extra levels/cars/characters/songs/films online or are intent on building the ultimate technophile's living room setup, it's the sort of holiday gift that may be little extravagant for anyone younger than 15."
  },
  {
    "name": "Playstation 4",
    "developer": "Sony",
    "releaseDate": "15th November 2013",
    "unitsSold": "Exactly 81,000,000",
    "memory": "8GB GDDR5, 256MB DDR3 RAM",
    "storage": "Ranging from 500GB to 2TB",
    "photo": "ps4.jpg",
    "moreInfoRef": "https://uk.ign.com/articles/2013/11/13/playstation-4-review",
    "ref": "ps4",
    "sonasR": "Best PlayStation controller yet, great graphics, lack of originality with exclusives - 8/10",
    "moreInfo": "Jet black with sharp, angular edges and a blend of matte and high-gloss plastic, the PS4 distances itself from the curved lines found on the PS3, and instead follows the design language found on Sony's broader range of smartphones, tablets, and home entertainment products. The result is a distinctly more mature, high-end look and feel. The thin LED illuminated strip that pierces through the topmost panel offers a burst of color and light, but also serves a practical purpose by indicating the various states of the system's operation - orange while on standby, pulsing blue when powering up or shutting down, and a steady white while in use. On the front, two thin, semi-metallic capacitive buttons align with the light strip - one for toggling the system power, the other for ejecting discs from the slot-loading drive. It's the most elegant console design in PlayStation history and one of the best looking products Sony has ever produced. But the PS4's form is sometimes at odds with its function. A cutaway wraps around the front and sides of the system, which breaks up the top and bottom panels and prevents the design from taking on too much of a nondescript brick-like trapezoid appearance. The gap houses the front-facing USB ports and slot-loading disc drive, with air intakes on the sides, which draws cool air through the system. Though a clever way to mask the ports and vents, the gap can create issues with certain types of USB storage. While average-sized USB cables or thin thumbdrives fit the slots, thicker devices may not work without an extension cable. What's more, the thin touch-enabled buttons on the front are extremely narrow and tough to identify, and the choice to put the sole thermal exhaust at the back of the system will centralize heat where ventilation will be most limited in entertainment centers. Ultimately, each decision is in service of the PS4's unbelievably compact form factor. Measuring at roughly 2inches thick, 10.8inches wide, and 12inches deep, the PS4 is 35% thinner and takes up considerably less surface area than the Xbox One. It's even slightly thinner than the PS3 Super Slim. In other words, the PS4 is entering the new generation with a form factor smaller than what had previously taken six years to reach with the PS3. Even more impressive is how quiet and relatively cool the PS4 remains throughout hours of use. Although by no means silent, the PS4's noise profile never seems to exceed a gentle hum, even when running the most GPU-taxing titles. When placed on the entertainment center eight feet from my couch, it was hard to even notice."
  },
  {
    "name": "Xbox",
    "developer": "Microsoft",
    "releaseDate": "15th November 2001",
    "unitsSold": "A wee bit over 24,000,000",
    "memory": "64MB DDR SDRAM",
    "storage": "8GB or 10GB internal hard drive",
    "photo": "xbox.png",
    "ref": "xbox",
    "sonasR": "Underrated, great exclusives and birthed many great games series - 8.5/10",
    "moreInfoRef": "https://www.cnet.com/reviews/microsoft-xbox-review/",
    "moreInfo": "Microsoft's Xbox is a Trojan horse. The company has conquered the desktop and now seems intent on sneaking a PC into your living room. Yes, this black behemoth of a system looks and acts just like a video game machine--and a state-of-the-art one at that. But with built-in support for high-speed networking, an 8GB hard drive, DVD playback capabilities, and display support for HDTVs, the Xbox does more than just play games. Updated 11/13/02. Microsoft's Xbox is a Trojan horse. The company has conquered the desktop and now seems intent on sneaking a PC into your living room. Yes, this black behemoth of a system looks and acts just like a video game machine--and a state-of-the-art one at that. But with built-in support for high-speed networking, an 8GB hard drive, DVD playback capabilities, and display support for HDTVs, the Xbox does more than just play games. With a front-loading disc tray, two buttons, and four controller ports adorning the face, the monstrous case will look at right at home among your other home-theater components. Inside this eight-pound box you'll find the power of a PC (a 733MHz Intel processor; 64MB of RAM; and a custom Nvidia graphics board, the NV2A) and the heart of a video game console. Still, as nice as all that processing power is, what really matter is the onscreen results. Video enthusiasts will appreciate that the Xbox works not only with standard 4:3 TVs but with HDTVs as well. If you have an HD-ready set, you can set the Xbox to output 480p, 720p, and 1,080i signals in either normal or wide-screen (16:9) aspect ratios for your games. The Xbox is capable of producing 1,080i images, but the games themselves, such as Halo and Dead or Alive 3, haven't been optimized for that high a level yet. Still, the images are crisp and sharp. A nice complement to this visual horsepower is the fact that the Xbox supports 5.1 Dolby Digital surround sound and deliver 256 simultaneous voice channels--previously unheard of in a game system. All of this adds up to some of the richest, most realistic experiences we've yet to see in video games."
  },
  {
    "name": "Xbox 360",
    "developer": "Microsoft",
    "releaseDate": "22nd November 2005",
    "unitsSold": " Only 84,000,000",
    "memory": "512MB GDDR3 RAM",
    "storage": "Ranging from 20GB to 320GB",
    "photo": "xbox360.jpg",
    "ref": "xbox360",
    "sonasR": "Best console ever released for its time, very strong game library and the best controller around - 11/10",
    "moreInfoRef": "https://uk.ign.com/articles/2005/12/02/xbox-360-the-launch-review?page=2",
    "moreInfo": "There is little argument here: The Xbox 360 is a powerful beast that's easily more powerful than 95% of the PCs available today. That will change in the next year or year and a half, but it's impressive nonetheless. The 360 is packed with an enormous amount of processing power, graphic potential, and a healthy amount of flexible memory. With the vehicles in PGR3 using 80,000 polygons per car, graphics aren't going to be the focus any more, it'll be what developers are doing with said graphics. The three 3.2 GHz processors can be independently programmed (enabling programmers to target six threads), which is both a strength and weakness, given traditional programming is done for one processor and the new requirement of having extremely efficient and clean code. Still, the amount of power harnessed in the 360 will enable programmers to finally dig into even deeper, more realistic physics, create greater facial expressions, and invent new gameplay scenarios, and not have to worry about whether the game will look good. They'll all look good."
  },
  {
    "name": "Xbox One",
    "developer": "Microsoft",
    "releaseDate": "22nd November 2013",
    "unitsSold": "A massive 20,000,000",
    "memory": "8GB DDR3",
    "storage": "Ranging from 500GB to 2TB",
    "photo": "xboxone.jpg",
    "ref": "xboxone",
    "sonasR": "Some annoying features, great games and the ability to play older generation games, solid overall - 8/10",
    "moreInfoRef": "https://uk.ign.com/articles/2014/11/27/xbox-one-review-2014",
    "moreInfo": "Measuring 13.1inch x 10.8inch x 3.25inch, the Xbox One is beefy. It looks like a traditional media center set-top box-Microsoft has more or less said it was purposely designed this way-but despite its hulking size, you won't notice it when it's running, as it's ultra quiet. (Though you may hear its disc drive during times you're installing games or watching TV shows/movies on low volume, depending on your system. Some are slightly noisier than others. On its exterior, the Xbox One boasts glossy black panels, silver accents, and matte black vents, with a minimalist front panel that hosts just a power button behind the white-backlit Xbox logo and Blu-ray disc drive slot. In some ways, it tries too hard to be modern; the power button's capacitive nature means that any light touch can unintentionally turn the box on or off. That's tolerable when you've got the system set to instant-on mode, since you can resume a game exactly where you left off if you accidentally switch off power. But if you're in tight quarters and prone to bumping into that button, having the console set to energy-saving mode can have tragic consequences for your in-game progress. When it comes to internal specs, the Xbox One holds relatively close to its main competitor, the PlayStation 4. There's a 1.75GHz custom AMD APU, which combines the CPU and graphics processor in a single chip composed of two quad-core modules; a 5400RPM 500GB internal hard drive (on standard models); and 802.11a/b/g/n wi-fi. Where it differs from the PS4 is its support for Wi-Fi Direct, a lack of Bluetooth, no ability to replace the hard drive, and its combo of 8GB of DDR3 memory and 32MB of eSRAM (as compared to the PS4's 8GB of faster GDDR5 RAM)."
  },
  {
    "name": "GameCube",
    "developer": "Nintendo",
    "releaseDate": "14th September 2001",
    "unitsSold": "In the ballparl of 21,000,000",
    "memory": "GameCube memory card (16MB max capacity)",
    "storage": "None",
    "photo": "gamecube.png",
    "ref": "gamecube",
    "sonasR": "I have played less than 5 hour of the GameCube in my life, but it has Super Smash Bros - 9/10",
    "moreInfoRef": "https://www.cnet.com/reviews/nintendo-gamecube-review/",
    "moreInfo": "Nintendo thinks that good things should come in small packages, and the affordable GameCube, about the size of a squat lunch box, certainly proves that point. Unlike the PlayStation 2 and the Xbox, which aspire to be DVD players and living-room minicomputers, this is exclusively a game machine--and a fun, powerful one at that, offering games suited to a broad audience. playback, but you'll need the $30 component-video connector and an HDTV to take advantage of the superior picture quality. We tried out a third-party S-Video connector and found the picture to be quite sharp with titles such as Metroid Prime and Monkey Ball 2 on a standard 4:3 TV, as well as an HD-ready Samsung set. So long as a game is optimized for the GameCube, its graphics best that of the PS2, and, in some cases, match that of the Xbox. Overall, however, the Xbox offers slightly superior graphics and performance. While the GameCube is a decent performer visually, it lacks the big audio dynamite of digital-audio outputs. This is likely another cost-cutting maneuver that can hopefully be addressed with a different cable output. Presently, however, none is available"
  },
  {
    "name": "Wii",
    "developer": "Nintendo",
    "releaseDate": "19th November 2006",
    "unitsSold": "In the neighbourhood of 101,000,000",
    "memory": "88MB",
    "storage": "512MB internal flash storage",
    "photo": "wii.jpg",
    "ref": "wii",
    "sonasR": "The huge number of sales is hugely missleading, the console was groundbreaking for its time but it sucked, like it really sucked - 5/10",
    "moreInfoRef": "https://www.techradar.com/uk/reviews/gaming/games-consoles/nintendo-wii-446958/review",
    "moreInfo": "For sheer playability, there's no better console than the Wii. Its former codemame, Revolution, describes it superbly. The motion sensitive controllers are just that, and with the addition of extra controllers such as the Wii Fit Balance board, Nintendo is managing to take the concept outside the traditional realms of gaming. If you haven't played on a Wii, you won't quite know what it's like to experience. Not only are the motion sensitive controllers unbelievably responsive and easy-to-use, but it's at its best for family gaming where even grandparents can pick things up pretty quickly in simple games." },
  {
    "name": "Wii U",
    "developer": "Nintendo",
    "releaseDate": "18th November 2012",
    "unitsSold": "Approximately 13,000,000",
    "memory": "2GB DDR3",
    "storage": "8GB",
    "photo": "wiiu.png",
    "ref": "wiiu",
    "sonasR": "The concept is really cool, but the system lacked in the number of games, some of the games are masterpieces though - 7.5/10",
    "moreInfoRef": "https://uk.ign.com/articles/2014/11/30/wii-u-review-2014",
    "moreInfo": "The Wii U may not be the most powerful console of the market, but what it lacks in specs it makes up for with a stellar lineup of first-party games and innovative (if underused) hardware. Lack of support from significant third partiws like EA and Activision still holds the console back, though, and the gaps in its library left by absent multiplatform games are significant. but its tough to beat the unique experiences that the Wii U offers. Second-screen gaming, unique tablet integration, and a clutch of generation-defining exclusives make the Wii U impossible to ignore. After two years of growth, the Wii U has become a great system that can still offer much more"
  },
  {
    "name": "Nintendo Switch",
    "developer": "Nintendo",
    "releaseDate": "3rd March 2017",
    "unitsSold": "In spitting distance of 20,000,000",
    "memory": "4GB LPDDR4",
    "storage": "32GB internal flash memory",
    "photo": "switch.jpg",
    "ref": "switch",
    "sonasR": "The Nintendo Switch and the PS4 are my current go-to consoles to play games, although I haven't touched my Playstation in months - 10/10",
    "moreInfoRef": "https://uk.ign.com/articles/2017/03/08/nintendo-switch-review",
    "moreInfo": "Nintendo Switch is a breakthrough home video game system. It not only connects to a TV at home, but it also instantly transforms into an on-the-go handheld using its own screen. For the first time, players can enjoy a full home-console experience anytime, anywhere. The versatile Joy-Con offer multiple surprising new ways for players to have fun. Two Joy-Con can be used independently in each hand, or together as one game controller when attached to the Joy-Con grip. They can also attach to the main console for use in handheld mode, or be shared with friends to enjoy two-player action in supported games. Each Joy-Con has a full set of buttons and can act as a standalone controller, and each includes an accelerometer and gyro-sensor, making independent left and right motion control possible. The screen includes capacitive multi-touch capabilities for compatible games. "
  }
]}
